IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_hrpwmcal_regs.xml
<module id="HRPWMCAL_REGS" HW_revision="" description="HRPWMCAL Registers">
	<register id="HRPWR" width="16" page="1" offset="0x21" internal="0" description="HRPWM Power Register">
		<bitfield id="CALPWRON" description="Calibration Power On" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="HRMSTEP" width="16" page="1" offset="0x26" internal="0" description="HRPWM MEP Step Register">
		<bitfield id="HRMSTEP" description="High Resolution Micro Step Value" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
</module>
